<?php $root = ""; ?>

<?php include($root . "header.php"); ?>

<main id="main" class="csr-main">
    <?php
    $hero = [
        "subttl" => "โครงการเพื่อความยั่งยืน",
        "ttl" => "นโยบายความยั่งยืน",
        "banner-class" => "banner-with-header-text",
        "cover" => [
            "pc" => "./assets/media/design/csr-hero.jpg",
            "mb" => "./assets/media/design/csr-hero.jpg"
        ],
        "banner-header" => [
            "subttl" => "วิสัยทัศน์",
            "ttl" => "สร้างสรรค์ผลิตภัณฑ์และบริการที่เป็นเลิศ สร้างเสริมคุณภาพชีวิตเพื่อทุกคน"
        ]
    ];

    include($root . "include/sc-hero-template.php");
    ?>

    <section data-section="csr-tabs">
        <div class="sc-inner">
            <div class="container xl">
                <div class="tab-container">
                    <div class="sc-header">
                        <div class="sc-ttl">
                            <h2>โครงการทั้งหมด</h2>
                        </div>
                    </div>

                    <?php
                    $tabs_arr = [
                        [
                            "img" => './assets/media/design/tab-image-1.jpg',
                            "tab-id" => '#csr-1',
                            "tab-text" => "โครงการแผงยาช่วยโลก",
                            "tab-ttl" => "โครงการแผงยาช่วยโลก",
                            "tab-desc" => "“แผงยาช่วยโลก” ไอเดียสร้างสรรค์ช่วยโลกเพื่อความยั่งยืน ภายใต้การนำของ ภก.ชาญชัย อุดมลาภธรรม CEO อาร์เอ็กซ์ กรุ๊ป โครงการดี ๆ ส่งเสริมการจัดการขยะอย่างยั่งยืน โดยนำขยะจากแผงฟอยล์อะลูมิเนียมที่เหลือจากการผลิตภายในโรงงานในการผลิตยาสามัญประจำบ้าน เช่น air x, degas ฯลฯ ที่สร้างขยะมากกว่า 20 ตันต่อปี ยังไม่รวมกับ บรรจุภัณฑ์ที่อยู่ในฝั่งของผู้บริโภคอีกมหาศาล ซึ่งอะลูมิเนียมฟอยล์ดังกล่าวใช้เวลาในการย่อยสลายตามธรรมชาติประมาณ 100 ปี และหากไม่ถูกการจัดการที่ถูกต้องส่งผลเสียต่อสิ่งแวดล้อมอย่างหลีกเลี่ยงไม่ได้ ทางบริษัทฯ จึงต้องการเป็นส่วนหนึ่งในการสร้างความยั่งยืนที่แท้จริง จึงเกิดเป็นโครงการดังกล่าวนี้.",
                            "tab-link" => $root . "csr-1.php",
                        ],
                        [
                            "img" => './assets/media/design/tab-image-2.jpg',
                            "tab-id" => '#csr-2',
                            "tab-text" => "โครงการพลังงานทดแทน",
                            "tab-ttl" => "โครงการพลังงานทดแทน",
                            "tab-desc" => "“แผงยาช่วยโลก” ไอเดียสร้างสรรค์ช่วยโลกเพื่อความยั่งยืน ภายใต้การนำของ ภก.ชาญชัย อุดมลาภธรรม CEO อาร์เอ็กซ์ กรุ๊ป โครงการดี ๆ ส่งเสริมการจัดการขยะอย่างยั่งยืน โดยนำขยะจากแผงฟอยล์อะลูมิเนียมที่เหลือจากการผลิตภายในโรงงานในการผลิตยาสามัญประจำบ้าน เช่น air x, degas ฯลฯ ที่สร้างขยะมากกว่า 20 ตันต่อปี ยังไม่รวมกับ บรรจุภัณฑ์ที่อยู่ในฝั่งของผู้บริโภคอีกมหาศาล ซึ่งอะลูมิเนียมฟอยล์ดังกล่าวใช้เวลาในการย่อยสลายตามธรรมชาติประมาณ 100 ปี และหากไม่ถูกการจัดการที่ถูกต้องส่งผลเสียต่อสิ่งแวดล้อมอย่างหลีกเลี่ยงไม่ได้ ทางบริษัทฯ จึงต้องการเป็นส่วนหนึ่งในการสร้างความยั่งยืนที่แท้จริง จึงเกิดเป็นโครงการดังกล่าวนี้.",
                            "tab-link" => $root . "csr-2.php",
                        ],
                        [
                            "img" => './assets/media/design/tab-image-3.jpg',
                            "tab-id" => '#csr-3',
                            "tab-text" => "โครงการสนับสนุนด้านการศึกษา",
                            "tab-ttl" => "โครงการสนับสนุนด้านการศึกษา",
                            "tab-desc" => "“แผงยาช่วยโลก” ไอเดียสร้างสรรค์ช่วยโลกเพื่อความยั่งยืน ภายใต้การนำของ ภก.ชาญชัย อุดมลาภธรรม CEO อาร์เอ็กซ์ กรุ๊ป โครงการดี ๆ ส่งเสริมการจัดการขยะอย่างยั่งยืน โดยนำขยะจากแผงฟอยล์อะลูมิเนียมที่เหลือจากการผลิตภายในโรงงานในการผลิตยาสามัญประจำบ้าน เช่น air x, degas ฯลฯ ที่สร้างขยะมากกว่า 20 ตันต่อปี ยังไม่รวมกับ บรรจุภัณฑ์ที่อยู่ในฝั่งของผู้บริโภคอีกมหาศาล ซึ่งอะลูมิเนียมฟอยล์ดังกล่าวใช้เวลาในการย่อยสลายตามธรรมชาติประมาณ 100 ปี และหากไม่ถูกการจัดการที่ถูกต้องส่งผลเสียต่อสิ่งแวดล้อมอย่างหลีกเลี่ยงไม่ได้ ทางบริษัทฯ จึงต้องการเป็นส่วนหนึ่งในการสร้างความยั่งยืนที่แท้จริง จึงเกิดเป็นโครงการดังกล่าวนี้.",
                            "tab-link" => $root . "csr-3.php",
                        ],
                        [
                            "img" => './assets/media/design/tab-image-4.jpg',
                            "tab-id" => '#csr-4',
                            "tab-text" => "โครงการช่วยเหลือน้องออทิสติก",
                            "tab-ttl" => "โครงการช่วยเหลือน้องออทิสติก",
                            "tab-desc" => "“แผงยาช่วยโลก” ไอเดียสร้างสรรค์ช่วยโลกเพื่อความยั่งยืน ภายใต้การนำของ ภก.ชาญชัย อุดมลาภธรรม CEO อาร์เอ็กซ์ กรุ๊ป โครงการดี ๆ ส่งเสริมการจัดการขยะอย่างยั่งยืน โดยนำขยะจากแผงฟอยล์อะลูมิเนียมที่เหลือจากการผลิตภายในโรงงานในการผลิตยาสามัญประจำบ้าน เช่น air x, degas ฯลฯ ที่สร้างขยะมากกว่า 20 ตันต่อปี ยังไม่รวมกับ บรรจุภัณฑ์ที่อยู่ในฝั่งของผู้บริโภคอีกมหาศาล ซึ่งอะลูมิเนียมฟอยล์ดังกล่าวใช้เวลาในการย่อยสลายตามธรรมชาติประมาณ 100 ปี และหากไม่ถูกการจัดการที่ถูกต้องส่งผลเสียต่อสิ่งแวดล้อมอย่างหลีกเลี่ยงไม่ได้ ทางบริษัทฯ จึงต้องการเป็นส่วนหนึ่งในการสร้างความยั่งยืนที่แท้จริง จึงเกิดเป็นโครงการดังกล่าวนี้.",
                            "tab-link" => $root . "csr-4.php",
                        ],
                    ];

                    include($root . "include/el-tab-links.php");
                    ?>

                    <div class="tab-contents">
                        <?php
                        foreach ($tabs_arr as $index => $value) {
                        ?>
                            <div class="tab-content <?php if ($index == 0) echo "active" ?>" id="<?= substr($value["tab-id"], 1) ?>">

                                <div class="text-content">
                                    <h2 class="ttl animate fadeIn"><?= $value["tab-ttl"] ?></h2>
                                    <p class="desc animate fadeIn"><?= $value["tab-desc"] ?></p>
                                    <a href="<?= $value["tab-link"] ?>" class="button animate fadeIn">
                                        ดูรายละเอียด
                                    </a>
                                </div>

                                <div class="featured-image animate fadeIn">
                                    <?php
                                    $section_cover = $value["img"];
                                    $section_cover_m = "";
                                    include("include/function-group.php");
                                    ?>
                                </div>
                            </div>
                        <?php } ?>
                    </div>
                </div>
            </div>
        </div>
    </section>

    <?php
    $dual_image_block = [
        "block" => [
            [
                "image" => "./assets/media/design/dual-image-3.jpg",
                "ttl" => "นโยบายความยั่งยืน",
                "desc" => "บริษัท อาร์เอ็กซ์ แมนูแฟคเจอริ่ง จำกัด ก่อตั้งในปี พศ. 2546 โดยผู้บริหารจากบริษัท อาร์เอ็กซ์ จำกัด",
                "link" => $root . "csr.php",
                "button-text" => "รายละเอียด"
            ],
            [
                "image" => "./assets/media/design/dual-image-1.jpg",
                "ttl" => "ติดต่อเรา",
                "desc" => "บริษัท อาร์เอ็กซ์ จำกัด<br>93/90 ซอยประชานุกูล 2 ถนนรัชดาภิเษก<br>แขวงบางซื่อ เขตบางซื่อ กรุงเทพฯ 10800",
                "link" => $root . "contact.php",
                "button-text" => "ติดต่อเรา"
            ],
        ]
    ];

    include($root . "include/sc-dual-image-block.php");
    ?>
</main>

<?php include($root . "footer.php"); ?>